app/views/consulta/_form.html.erb

    <%= form.label :medico_id, style: "display: block" %>
    <%= form.collection_select(:medico_id, Medico.all, :id, :nome, { selected: @consultum.medico_id }, { class: "form-field" }) %>
---
SELECT "medicos".* FROM "medicos"

    <%= form.label :paciente_id, style: "display: block" %>
    <%= form.collection_select(:paciente_id, Paciente.all, :id, :nome, { selected: @consultum.paciente_id }, { class: "form-field" }) %>
---
SELECT "pacientes".* FROM "pacientes"