app/controllers/consulta_controller.rb

SELECT "medicos".* FROM "medicos"
SELECT "pacientes".* FROM "pacientes"
---
  def new
    @consultum = Consultum.new
    @medico = Medico.all
    @paciente = Paciente.all