app/controllers/medicos_controller.rb

  def index
    @medicos = Medico.all
---
SELECT "medicos".* FROM "medicos"

  def consultas_agendadas
    @medico = Medico.find(params[:id])
---
SELECT "medicos".* FROM "medicos" WHERE "medicos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @medico = Medico.new(medico_params)

    respond_to do |format|
      if @medico.save
---
INSERT INTO "medicos" ("nome", "data_nascimento", "cpf", "email", "especialidade", "crm", "consultas_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @medico.destroy
---
DELETE FROM "medicos" WHERE "medicos"."id" = ?  [["id", 1]]

    def set_medico
      @medico = Medico.find(params[:id])
---
SELECT "medicos".* FROM "medicos" WHERE "medicos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]