app/controllers/pacientes_controller.rb

SELECT "pacientes".* FROM "pacientes"
---
  def index
    @pacientes = Paciente.all

INSERT INTO "enderecos" ("logradouro", "complemento", "cep", "bairro", "cidade", "paciente_id") VALUES (?, ?, ?, ?, ?, ?)  [["logradouro", "asdasdads"], ["complemento", "asdasdasd"], ["cep", "55380-000"], ["bairro", "asdasdasd"], ["cidade", "Cachoeirinha"], ["paciente_id", 1]]
INSERT INTO "pacientes" ("nome", "data_nascimento", "cpf", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @paciente = Paciente.new(paciente_params)
    @paciente.endereco = Endereco.new(paciente_params[:endereco_attributes])

    respond_to do |format|
      if @paciente.save

DELETE FROM "pacientes" WHERE "pacientes"."id" = ?  [["id", 4]]
---
  def destroy
    @paciente.destroy

SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_paciente
      @paciente = Paciente.find(params[:id])